package _04_spot_the_error;

import javax.swing.JOptionPane;

public class MethodCall {

	// This program is supposed to print the message "Hello World".
	// BUT it's not working. If you don't believe me, try running it.
	// Add ONE line of code to fix this program.

	public static void main(String[] args) {
	for (int i=0; i<9; i++) {
		printMessage("c̲̋͆͌ͨ͌͂̎̒̌͠f̝̲͔̼̈ͯ̊ͤ̉̍́g̟̻͙̫͎̬̣̐ͪ͗͌́͐̆ͥ͝bͬ̔̌͏̪̭j̴͈̭͔̰͈̙ͮ̇̅̀ͅḫ̰̾͑ͨ͂̓̍͝m̙̫̯͕͍̤̭̺̩͋̐̌ͧk̩̖͚̼͉̻̜̑̋̕̕͡l̷̻͓͔̭̫͒ͩͥ̅̂ͭ;̨̮͓̻̞̣̹̃̃͛̇̚͞ͅ,̷͖́k͖̪͇̬͙ͧ̋̃ͥͪ̀͂̽j̥͍̪͎͕̋̚͠͡ḧ̭̺́̌͂ͯ̃ͬ͟y̮͔̬͔͕̅͒̍̀͆u̵͈̩͒ͮ̑̓͌t͔̹̻̠̦̘̜͈͋ͩ͆̀͜͞d̗̮̤͍͆̎̌̎ͣͩͨ̿͗͠ṛ̝̣͓̩̙̊̔̐ͬͤ͂͐͢ͅs̙̫ͦ̊̽͒ͫ̃͠͡ȅ̲̟͉͈͖̉ͩ̈̐̔z̠̣̲ͭ̾̅͂̓ͯ̏ř̼̠̮̻͚͚̬͉͌̋̐͋͘x͕̟̺̝̤͙͕̣ͫ͗͊͑͟t̷̔̏́̈́̒҉͉̠͈̺̫͇͡y̖̼̝̠͍ͬ̉̐̏̚u̴̳͇̬̜̞ͨi̴̥̜̤͉̦̗̼̟ͪͫ̍̃̊̓̕n͛̑̅́͟҉̬̣̰̗͎͎̰i̐̔͑ͪ̓͏̢̝ǒ͔̩̍̀ͨ͠f̧̞̖̗̱̜̊̐̎͌̋̔͗ȳ̴̨̝̟̖̘̗̜̥̔ͮͯ̓ͮ̓̆̇͟d̵̠̦̫̝̯̠̹̫͐ͤ̽̈́͟ṭ̴̮͛̄͋ͧͩ̈͋̾û̖̗̺̬̓̋̃ͮs̪̘̮̪͉̽̅́̕ͅr̶͚̥̪͋ͬ͗̇̓y̅͛̎̊̆͗ͨ̒͏̵͙̰̙ͅͅ6̝͎̪̺͚̄͋̐̍͡x̛̤͈͚̙̦͙̬̣͙̒ͬ̾̿͒c̻̯̰̺͐̇͋̌ͧ̎ͥt̟̲͙ͥͪ͢u͉̩̻͕̣̰̲̗͒ͨͣ͂͜v͕̠͚̻͕̼̣̓̋̾̈͠ḭ̴̺̭͙̬̝̘͇͗̋͌ͩb̵̻̺̯͔̯̰̙̭̏͌ͪͣ͆͑͛͟ŭ̫̳͓̟̫̑͒ͧ̃̏̈́̾̍ō͎̿̈́į͈̙̻̩̟̼̅ͦ̏͐̍̏̈͌h̢̧͉͚͍̼̗̙̯̹͐̚p̯͎̦͚ͦ̅ͤ͞l͒̊̎͗҉̰̣̠͍g̢̪̮͙ͪͦ̄̎ͯ̕͢k̨̼͈̲̳̮̺̺̟̗̔͂͛̿͟f̸͓̖̳̝̒̿ͧ̀̋ͦ͝ͅḫ̛̺͎̣͕̤͙̌͊̌́̈́͆͟͝t̶̹̣̘̖̩̯͉̲͕̃͑̎d͛ͩ͗̇͆͑҉͇̘͈̻̪͓y͓̣̤̹̋̂͊͗̅͘r̐̓̈̀͜҉̻̞͓h̶̡̝͍̻̩̦͌̊ͮ̓ͥ͒̄̽c͙͉̼̱͒̍̈́̓̈́ͯ̑͘v̡̛͔̖̞͇̮̪ͭ̒͒́b̵̜̗̖̙̳̩̳ͯ̆̋ͩ͌̚h̜͙̱̬̒̅͠i͕͓̝̥̻͇̊̆ͪ̑̚h̷̭̹ͦ̾̑̿ͦ̄l̯̖͔̫͓̮ͬͬ͒̔̾k̛̪̣̫̼͌̑ͣͥ͋́͒ư̴̶͖̒̀̿ͯj̵̦̬͖̫͍̹́͋ͩd̫̲͇̣͙̺̈ͯͅt̢͕̮͔͈̝̟ͨ͞͝h͉͙̭̤̮͖̃͘u͕̠̖̱͓͎͎̪̹̎̓c̪̱̖͇ͥ͌̽̽ͅv̶̷̰͔̜̭̘̰̻ͩ̇̒ͤ̚y̯̹ͣ̀ͦͩ͘͜i̧̩̖̖̹͓̻͌͘b̢̞̞̼̦̹̝̫ͮ̑̽̀̇́u̸̪̘̘̬̗̻̟ͪͤ̌ͥͦ͞ǵͯ͆ͥ̚͡҉̰̱͕̫o̧̗̤̎̅͂͜ḩ͍̫̬͔͇̲ͦͩ̉̏ͤͮ͜͝p̶̞̲̹̰ͭ́̆̏̓ͅȍͬ́҉̸͙͚̟́l̦̗͕̳͇̫͇͕̿̾̌͋ͥͫͤ̀[̷ͮͩ̀̓̾͜ͅ;̸̪̻͖̗͙͎̪̂ͮͮ]̴͙̫̜͕̝̩̟̘̿̏̿ͩ͂͂ͦ\"̡̠̪͍̰͕͚̮̗̽ͫ̍̔'̶̗͚̤͔͖̆̿͂̏i̩̤͚͓̼̗̭̽͝uͧ̍҉̴̭̭̖y̏́̾͂̌̒̍͏̱͈̮͈̥̘̥̣ţ̰̫̙̹̲̿̀ͤͯͣ͐͌g̨̡̘̼̤͇͔͈͔ͬ̿͂̇͐ͪr͚̦̠͉̝̦̬̝̓̽̐̇̃̀ͅf̸̠̘͖̠͒̎͆̏ẋ̰̫̞͗ͧ̎ͪ̾́̚̕͟f̻̹̫͍̂ͨͦͪḣ̷̦̖͓̞̂͟c̐̒̍̀҉̻̞͙̤͖g̷͔̟͑̽͐͘j̵̘̼̟̫͕̩̍ͮ̔͘͝v̸ͫ̌̈́̋͏̢̝̻̖̜̬ͅk̨̫̬̲͇͐͋͌ͣͩͅb̫͎̖̰͕͎̼̳̊ͥ̈̏͋̕l̴̯̰̫͉̝̿͐̈́͐̑̄ͅb̳̥͕̣͕̜͍̤ͭ̒j͇͇̙ͪḽ̛ͯͧ͊̽͂̀̚n̹̼ͦ̂ͧ̌ͦͬ̄ͬ͡k̖͉̖̆̊̇ ̸͔͇̟̲̻͔̥̑0̉̓͋̈̄͏͇͙̳̞2͗̆̆̀͏̥̤̦̝̕͜8͒̎҉̜̼̟͈̙̹͢q̱̞̋̔͂̓̃̇̀̕5̷̞̲͙̻̬͙̺ͣ̃y̨̡̰̩̗̝̮̮̙̔h̴̢̙̳̻̭̙͕͉͍ͩ͊͂ͦ̄ͮ-͉̺̭̣̽̃ͨͪ͗ͥ3͔͔̣̜̓̃̓ͣ͟͞q̢̢͇̮̹̖̭͚̰̠̂̓̈͠ͅr̜̜̺̱̓ͯ͢w͍͙̗͔ͩͤ9͈̦͖̮͍̱͇̙̏͑͒̽ͭ͞͡͡a̸ͨ͊ͯͫ̊̄̽ͧ҉̝]̵͚̅̀́=̫̝̪̺̦̹͍̣ͣ͑̓-̣̹͈̦͓̀ͮ̎͛̚q̴͎̩͗ͯ̽ͅỤ̸̗͈͚̟̹͇̦̜ͮ̐͗̇̃͡S̰̠̩͉͔͂͆͗͆̎͟͟ͅf̴̧̘̮̣̳̺̮͕͖̤͗ͩ̓ͪͭ̌͛̓͢h͚̪̗̾́̌̍ͭ́̍0ͣ͌̒̈ͫ̋̂͏̤̫[̧ͦ̌̓̓̍ͯ̓͡͏̪̙ͅ ̗̳͎̹͉̻͓̓̆̃̆͐͋ͅq̸̧̰̦̝͓͎̩̚̕5̍̇̒̅͏̰̪̻̰̳̖3̷͔͙͔̜͎̌̍̌͑̋͊͊̚'̸̘͓̙̮̯͗̃͒̀̄̃ ̛̍ͦ͢҉̱͖̪̙͖ͅͅa̮̖̤͐̍͛̃̓̿̈́̌́w̱͔̌͗͂̿ͥ̓ͮͨa͑̏̒́̓ͦ͛͋͏̪̰̹̦̤ě̟̰̦̭̺̐̏ͫͪ̅ͩ͗ͥh̷͓̺̮͕̱̲̺ͤͨ̉ͪͣs̯͕̯̼̟̈̀̄n̡̢̰͖̪̬̼͈̦̯ͥ̆̋ͭ͊͒̒ͨ̇͟'͑̽͌͏̖̖̩̹̤̲̠p͔̯̹̗̯͖͌̑ͥ̀ͨ͐ͬ̏͟ȩ̛͇̤̂̕hͮͨͭ҉̢̫͍̦̬͕͘r̡̟̃͑̐ͧs͛ͦ͏̢҉͚̹͖̙͈̰̳̻-̡̙̫̘̜͕̬ͩ́͆̃ỵ̴̗ͥ̀ḥ̸͉̖̩̿̄̈́͛͌̾ͬ͐");
	}
	}

	static void printMessage(String aMessage) {
		System.out.println(aMessage);
	}
}
